{
  "backend/main.mo": "Defines data types and storage for videos, categories, settings, admin config, quizzes, results, and user profiles with authorization and blob storage mixins.",
  "feature_evidence.json": "Contains feature evidence entries describing implemented features, associated components, files, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Lists short descriptions of many frontend files, summarizing their responsibilities and functionality.",
  "frontend/index.css": "Tailwind base layer and CSS variable definitions for light and dark theme color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the root element and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, auth/role guards, and theme provider for the React app.",
  "frontend/src/components/admin/CategoriesManager.tsx": "Admin component to list, add, and delete video categories with confirmation dialogs and toast notifications.",
  "frontend/src/components/admin/DashboardVisualsForm.tsx": "Form for editing admin dashboard visual settings, including gradients, colors, and overlay values, with data loading and mutation updates.",
  "frontend/src/components/admin/DonationLinkForm.tsx": "Simple form to view and update the donation link stored in admin settings.",
  "frontend/src/components/admin/HomeContentEditor.tsx": "Dialog-based editor for homepage text fields, loading existing settings and submitting updates.",
  "frontend/src/components/admin/HomepageVisualsForm.tsx": "Form for configuring homepage visuals including hero background, overlay settings, and optional image upload with progress tracking.",
  "frontend/src/components/admin/LogoUploadForm.tsx": "Component for uploading, previewing, removing, and saving a site logo using ExternalBlob uploads.",
  "frontend/src/components/admin/QuizEditor.tsx": "Modal editor for creating or updating quizzes tied to videos, supporting dynamic questions, answers, and validation.",
  "frontend/src/components/admin/QuizzesManager.tsx": "Lists quizzes, supports creating, editing, and deleting quizzes with confirmation dialogs.",
  "frontend/src/components/admin/ThemeSettingsForm.tsx": "Displays and updates theme color settings using form inputs and mutation hooks.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Shows all users with anonymized identifiers and allows updating their status.",
  "frontend/src/components/admin/VideoEditorDialog.tsx": "Modal form for adding or editing videos, handling fields, thumbnail uploads, and mutations.",
  "frontend/src/components/admin/VideosManager.tsx": "Displays video list with thumbnails and provides create, edit, and delete actions via dialogs.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen informing the user of denied access and offering a link back home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to create a profile, saving it via a mutation in a modal form.",
  "frontend/src/components/donations/PostQuizDonationModal.tsx": "Modal shown after quiz completion that displays score and links to a donation page.",
  "frontend/src/components/donations/ShowSomeLoveButton.tsx": "Standalone donation button that opens the admin-configured donation link.",
  "frontend/src/components/home/HomeContent.tsx": "Renders home page hero text from admin settings and allows admins to edit it.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logo, navigation, login, donation button, and mobile menu using admin settings.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header, footer, theme initialization, and page content area.",
  "frontend/src/components/leaderboard/LeaderboardSection.tsx": "Fetches and displays top 5 quiz results with anonymized usernames.",
  "frontend/src/components/quizzes/QuizTakingCard.tsx": "Handles quiz answering, submission, scoring, and shows results plus donation modal.",
  "frontend/src/components/quizzes/VideoQuizSection.tsx": "Loads quizzes for a video and lets users select and take one.",
  "frontend/src/components/videos/VideoCard.tsx": "Displays a video with YouTube embed handling and quiz section for authenticated users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on user identity and invalidates related queries.",
  "frontend/src/hooks/useCurrentUser.ts": "Determines current user authentication, role, profile, and admin status using actor and queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as settings, videos, categories, and quizzes using an actor interface.",
  "frontend/src/hooks/useTheme.ts": "Applies theme colors from settings data to CSS variables and exposes the current theme.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light and dark mode CSS variables for colors, layout, and UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AccountPage.tsx": "Displays the user's quiz results with timestamps and scores, using a card layout and loading states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Provides an admin dashboard with tabbed management interfaces for videos, categories, quizzes, users, appearance, and home content.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with configurable hero visuals, leaderboard, and categorized video sections based on admin settings.",
  "frontend/src/utils/privacy.ts": "Generates an anonymized user label by extracting and truncating the last segment of an identifier.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and remove them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, container settings, animations, and plugins.",
  "project_state.json": "Defines the project's current state, architecture notes, and known issues for the Pocketflix ICP app."
}