{
  "backend/main.mo": "Defines types and storage maps for videos, categories, settings, admin config, quizzes, quiz results, and user profiles, including comparison functions. Sets up authorization, blob storage mixins, and initial state for approvals.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS base setup defining light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for home, account, and admin pages with role checks and wraps the app in theme and layout providers.",
  "frontend/src/components/admin/CategoriesManager.tsx": "Admin UI for adding and deleting video categories with validation, toasts, and confirmation dialog.",
  "frontend/src/components/admin/DashboardVisualsForm.tsx": "Admin form for editing dashboard visual settings such as gradients, accent colors, and overlays.",
  "frontend/src/components/admin/DonationLinkForm.tsx": "Form allowing admins to update the Selar donation link used by the app.",
  "frontend/src/components/admin/HomeContentEditor.tsx": "Modal form for editing homepage text fields and saving them via settings mutation.",
  "frontend/src/components/admin/HomepageVisualsForm.tsx": "Form for updating homepage visual settings, including background colors and hero image upload with progress.",
  "frontend/src/components/admin/LogoUploadForm.tsx": "Interface to upload, preview, remove, and save a site logo using blob uploads.",
  "frontend/src/components/admin/QuizEditor.tsx": "Dialog for creating or editing quizzes by selecting a video and managing questions and answers.",
  "frontend/src/components/admin/QuizzesManager.tsx": "UI for listing quizzes, creating new ones, editing existing ones, and deleting them with confirmation.",
  "frontend/src/components/admin/ThemeSettingsForm.tsx": "Form to configure and save primary and secondary theme colors.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays all users with their status and allows admins to update each user's status.",
  "frontend/src/components/admin/VideoEditorDialog.tsx": "Modal for creating or editing videos, including uploading thumbnails and submitting video metadata.",
  "frontend/src/components/admin/VideosManager.tsx": "Lists all videos with options to add, edit, or delete them, integrating with the VideoEditorDialog.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen showing an access denied message with a link back to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout and clearing cached queries.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to create a profile with name and optional email.",
  "frontend/src/components/donations/PostQuizDonationModal.tsx": "Post-quiz modal encouraging donations with a link from settings and score details.",
  "frontend/src/components/donations/ShowSomeLoveButton.tsx": "Button that opens the donation link if configured in admin settings.",
  "frontend/src/components/home/HomeContent.tsx": "Displays homepage hero text with optional admin editing via HomeContentEditor.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright text and link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component showing logo, navigation links, auth buttons, and mobile menu with conditional admin and account links.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper rendering header, footer, and children, with a loading state while theme data is fetched.",
  "frontend/src/components/leaderboard/LeaderboardSection.tsx": "Displays top quiz scores, handling loading, empty state, and showing top 5 anonymized results.",
  "frontend/src/components/quizzes/QuizTakingCard.tsx": "Quiz-taking UI that records answers, submits them, shows results, and triggers a post-quiz donation modal.",
  "frontend/src/components/quizzes/VideoQuizSection.tsx": "Fetches quizzes for a video and lets users select and take one using QuizTakingCard.",
  "frontend/src/components/videos/VideoCard.tsx": "Renders a video with YouTube embed parsing and shows quizzes if the user is authenticated and not blocked.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authentication state, user profile, and admin status using actor and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate settings, videos, categories, and other backend resources via an actor API.",
  "frontend/src/hooks/useTheme.ts": "Applies theme colors from settings data to CSS variables and exposes theme loading state.",
  "frontend/src/index.css": "Defines Tailwind layers and global CSS variables for colors, dark mode, and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Displays a user's quiz results using data from useGetMyQuizResults with loading and empty states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders admin dashboard tabs for managing videos, categories, quizzes, users, and appearance settings.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage using settings data to render hero visuals, categories, and featured videos with error and loading states.",
  "frontend/src/utils/color.ts": "Provides hex color validation, hex-to-RGB conversion, and number clamping utilities.",
  "frontend/src/utils/privacy.ts": "Generates anonymized user labels by shortening identifiers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and extended theme settings including OKLCH color variables.",
  "project_state.json": "Defines project metadata, state version, known issues, and feature request flags for the project."
}