{
  "backend/main.mo": "Defines core data types, storage maps, and comparison modules for videos, quizzes, user profiles, settings, and admin configuration with authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a homepage hero image UI update to affected frontend files and component versions.",
  "frontend-file-summaries.txt": "List of prewritten summaries for many frontend files describing their responsibilities and functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark CSS variables and theme tokens for the UI.",
  "frontend/index.html": "Base HTML entry point mounting the root element and loading the Vite React bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication and admin guards, and global layout and theme providers.",
  "frontend/src/components/admin/CategoriesManager.tsx": "Admin UI for listing, adding, and deleting video categories with confirmation dialogs.",
  "frontend/src/components/admin/DashboardVisualsForm.tsx": "Form allowing admins to view and update dashboard visual settings such as colors, gradients, and overlays.",
  "frontend/src/components/admin/DonationLinkForm.tsx": "Provides a form to view and update the donation link stored in admin settings, with validation and success/error toasts.",
  "frontend/src/components/admin/HomeContentEditor.tsx": "Dialog-based editor allowing admins to update various homepage text fields and save them via a mutation.",
  "frontend/src/components/admin/HomepageVisualsForm.tsx": "Form for configuring homepage visual settings including colors, overlays, and hero image upload with progress tracking.",
  "frontend/src/components/admin/LogoUploadForm.tsx": "Handles uploading, previewing, updating, and removing the site logo using ExternalBlob and admin settings.",
  "frontend/src/components/admin/QuizEditor.tsx": "Editor modal for creating or updating quizzes by selecting a video, adding questions, answers, and validation before saving.",
  "frontend/src/components/admin/QuizzesManager.tsx": "Displays a list of quizzes with create, edit, and delete actions, integrating QuizEditor and delete confirmation dialog.",
  "frontend/src/components/admin/ThemeSettingsForm.tsx": "Form for viewing and updating primary and secondary theme colors using settings data and mutation hooks.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Lists users with anonymized principals and allows admins to update user status via a dropdown.",
  "frontend/src/components/admin/VideoEditorDialog.tsx": "Dialog for adding or editing videos, including uploading thumbnails and selecting categories.",
  "frontend/src/components/admin/VideosManager.tsx": "Displays video library with options to add, edit, or delete videos and manages related dialogs.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen showing an access denied message with a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles Internet Identity login/logout states and clears cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to create a profile with name and optional email before proceeding.",
  "frontend/src/components/donations/PostQuizDonationModal.tsx": "Modal shown after a quiz encouraging donations using a configured link.",
  "frontend/src/components/donations/ShowSomeLoveButton.tsx": "Button that opens the configured donation link in a new tab if available.",
  "frontend/src/components/home/HomeContent.tsx": "Displays homepage hero text from settings with optional admin edit button and editor modal.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders a simple footer with credit text and a link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Shows site header with logo, navigation links, auth/admin options, and a mobile menu sheet.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides global page layout including themed header, footer, and content wrapper.",
  "frontend/src/components/leaderboard/LeaderboardSection.tsx": "Fetches and displays the top 5 leaderboard results with anonymized usernames and scoring.",
  "frontend/src/components/quizzes/QuizTakingCard.tsx": "Handles quiz answering, submission, scoring UI, and post-quiz donation modal.",
  "frontend/src/components/quizzes/VideoQuizSection.tsx": "Loads quizzes for a video and allows selecting and taking a quiz.",
  "frontend/src/components/videos/VideoCard.tsx": "Displays a video with YouTube embedding and includes quizzes if the user is allowed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, reinitializing and invalidating queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Determines current user authentication, role, and profile using actor and identity hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, loading stored identities, and handling login states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as settings, videos, categories, and more via an actor.",
  "frontend/src/hooks/useTheme.ts": "Applies theme colors from settings data to CSS variables and returns the active theme.",
  "frontend/src/index.css": "Sets global Tailwind base styles and defines extensive OKLCH color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Displays the user's quiz history using fetched results with loading and empty states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with configurable visuals and tabbed management panels for content, users, and appearance.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with dynamic hero visuals, leaderboard, and category‑organized video sections.",
  "frontend/src/utils/privacy.ts": "Provides a utility to anonymize a user ID by generating a short, stable label.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and persist URL params across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and plugin setup.",
  "project_state.json": "Describes the project's state, architecture, and known issues for the Pocketflix ICP web app."
}