{
  "backend/main.mo": "Defines types and storage for videos, categories, quizzes, settings, admin config, and user profiles with authorization and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for documentation or build reference.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, authentication guards, theme provider, and global layout for the React app.",
  "frontend/src/components/admin/CategoriesManager.tsx": "Admin UI for listing, adding, and deleting video categories with confirmation dialogs.",
  "frontend/src/components/admin/DashboardVisualsForm.tsx": "Admin form to edit dashboard visual settings and persist them via backend mutations.",
  "frontend/src/components/admin/DonationLinkForm.tsx": "Admin form for editing and saving the Selar donation link.",
  "frontend/src/components/admin/HomeContentEditor.tsx": "Dialog form for editing homepage hero text fields and saving them through updateHomePageText.",
  "frontend/src/components/admin/HomepageVisualsForm.tsx": "Form to configure homepage visuals including hero background, overlay, and optional hero image upload.",
  "frontend/src/components/admin/LogoUploadForm.tsx": "Component for uploading, previewing, removing, and saving a site logo via settings update.",
  "frontend/src/components/admin/QuizEditor.tsx": "Editor dialog for creating or updating quizzes, managing video selection, questions, answers, and validation.",
  "frontend/src/components/admin/QuizzesManager.tsx": "Displays quiz list with create, edit, and delete actions, integrating QuizEditor and deletion confirmation.",
  "frontend/src/components/admin/ThemeSettingsForm.tsx": "Simple form allowing admins to change and save primary and secondary theme colors.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays a list of users with their details and allows admins to change user status via dropdown.",
  "frontend/src/components/admin/VideoEditorDialog.tsx": "Modal form for adding or editing videos, including uploading thumbnails and selecting categories.",
  "frontend/src/components/admin/VideosManager.tsx": "Lists all videos with edit and delete actions and manages opening the video editor or delete confirmation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout via Internet Identity and updates query state accordingly.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to create a profile with name and optional email.",
  "frontend/src/components/donations/PostQuizDonationModal.tsx": "Displays a post-quiz modal encouraging users to donate, using a configurable external link.",
  "frontend/src/components/donations/ShowSomeLoveButton.tsx": "Button that opens the donation link if available.",
  "frontend/src/components/home/HomeContent.tsx": "Renders hero text for the home page and allows admins to open an editor to modify it.",
  "frontend/src/components/layout/AppFooter.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logo, navigation links, auth/admin options, and mobile sheet menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with theme setup, header, footer, and main content area.",
  "frontend/src/components/leaderboard/LeaderboardSection.tsx": "Fetches and displays top 5 leaderboard results with loading and empty states.",
  "frontend/src/components/quizzes/QuizTakingCard.tsx": "Renders quiz questions, submits answers, shows score, and optionally opens donation modal.",
  "frontend/src/components/quizzes/VideoQuizSection.tsx": "Loads quizzes for a video and lets users select and take a quiz.",
  "frontend/src/components/videos/VideoCard.tsx": "Displays a video with YouTube embed parsing and shows quiz section for authenticated users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authentication state, user role (admin), and caller profile via backend queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity, and auth client state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating settings, videos, categories, and other backend data using an actor.",
  "frontend/src/hooks/useTheme.ts": "Applies theme colors from settings data to CSS variables and returns the active theme.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark theme CSS variables using OKLCH values.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Displays the user's quiz history using fetched quiz results with loading and empty states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing videos, categories, quizzes, users, donation links, home content, and appearance settings.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage using settings data, rendering hero visuals, categories, and video sections with error and loading handling.",
  "frontend/src/utils/color.ts": "Provides hex color validation, hex-to-RGB conversion, and a clamp utility.",
  "frontend/src/utils/privacy.ts": "Generates an anonymized, short user label based on an identifier.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors via CSS variables, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing Pocketflix’s architecture, features, and known issues for the ICP-based video-learning app."
}