{
  "backend/main.mo": "Defines core types for videos, quizzes, settings, admin config, and stores them in maps with basic comparison utilities and authorization/storage mixins.",
  "feature_evidence.json": "Lists feature evidence for a republish/redeploy task, mapping relevant frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for major frontend components, hooks, and utilities across the app.",
  "frontend/index.css": "Tailwind base and utility layers plus CSS variable themes for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with guarded account/admin routes, theme provider, profile setup modal, and toaster.",
  "frontend/src/components/admin/CategoriesManager.tsx": "Admin UI to list, add, and delete video categories with confirmation dialogs and toast feedback.",
  "frontend/src/components/admin/DashboardVisualsForm.tsx": "Form for admins to edit dashboard visual settings and submit updates via backend mutations.",
  "frontend/src/components/admin/DonationLinkForm.tsx": "Provides a form to view and update the site's donation link using settings data and mutation hooks.",
  "frontend/src/components/admin/HomeContentEditor.tsx": "Dialog-based editor for updating home page text fields, loading current settings and submitting updates.",
  "frontend/src/components/admin/HomepageVisualsForm.tsx": "Form for customizing homepage visuals, including hero background, overlay settings, and optional image upload with progress tracking.",
  "frontend/src/components/admin/LogoUploadForm.tsx": "Allows uploading, previewing, removing, and saving a custom site logo using ExternalBlob uploads.",
  "frontend/src/components/admin/QuizEditor.tsx": "Editor dialog for creating or updating quizzes, supporting video selection and dynamic question and answer management.",
  "frontend/src/components/admin/QuizzesManager.tsx": "Displays all quizzes with options to create, edit, or delete quizzes, integrating QuizEditor and confirmation dialogs.",
  "frontend/src/components/admin/ThemeSettingsForm.tsx": "Form allowing admins to view and update primary and secondary theme colors, syncing with backend settings and showing success/error toasts.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays all users with anonymized identifiers and lets admins update each user's status via a select control.",
  "frontend/src/components/admin/VideoEditorDialog.tsx": "Modal dialog for creating or editing videos, handling title, category, URL, thumbnail upload, and saving via backend mutations.",
  "frontend/src/components/admin/VideosManager.tsx": "Lists all videos with thumbnails and provides controls to add, edit, or delete videos using dialogs and confirmation prompts.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Simple screen showing an access denied message with an option to return to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling login and logout using Internet Identity, updating query cache and showing appropriate states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to create a profile with name and optional email before continuing.",
  "frontend/src/components/donations/PostQuizDonationModal.tsx": "Post-quiz popup showing the user's score and offering a donation link pulled from admin settings.",
  "frontend/src/components/donations/ShowSomeLoveButton.tsx": "Button that opens the configured donation link if available, styled with theme-based gradient colors.",
  "frontend/src/components/home/HomeContent.tsx": "Displays homepage hero text with optional admin editing via HomeContentEditor.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders site footer with branding and a caffeine.ai credit link.",
  "frontend/src/components/layout/AppHeader.tsx": "Shows site header with navigation, logo, auth buttons, and admin links when applicable.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with header, footer, theme loading, and layout structure.",
  "frontend/src/components/leaderboard/LeaderboardSection.tsx": "Fetches and displays the top 5 leaderboard results with anonymized usernames.",
  "frontend/src/components/quizzes/QuizTakingCard.tsx": "Handles quiz answering, submission, scoring, and post-quiz donation modal.",
  "frontend/src/components/quizzes/VideoQuizSection.tsx": "Loads quizzes for a video and allows selecting and taking a quiz.",
  "frontend/src/components/videos/VideoCard.tsx": "Renders a video with YouTube embed parsing and optional quizzes for authenticated users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, handling access control initialization.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides authentication state, admin status, and user profile using the actor and queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication and manages identity loading, login, and logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating settings, videos, categories, and related backend data using an actor.",
  "frontend/src/hooks/useTheme.ts": "Applies theme colors from settings to CSS variables and exposes the current theme.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light and dark mode CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AccountPage.tsx": "Displays a user's quiz results with loading and empty states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing videos, categories, quizzes, users, appearance, and homepage content.",
  "frontend/src/pages/HomePage.tsx": "Builds the home page using settings data, applying hero visuals, category grouping, and fallback behaviors.",
  "frontend/src/utils/color.ts": "Provides hex color validation, hex-to-RGB conversion, and a clamp utility.",
  "frontend/src/utils/privacy.ts": "Creates a short anonymized user label based on an identifier.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, and clear URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animation.",
  "project_state.json": "Project metadata describing the current fix request, known issues, and existing features for build state management."
}