{
  "kind": "build_request",
  "title": "Expose homepage hero background image upload in Admin “Home Page” tab",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Update the Admin Dashboard UI so admins can clearly find and use the homepage hero/background image upload control from the “Home Page” tab (not only under “Appearance”), by surfacing the existing `HomepageVisualsForm` in an easy-to-discover location within the “Home Page” tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "There's no place to upload the background image"
        ]
      },
      "acceptanceCriteria": [
        "When an admin opens Admin Dashboard → “Home Page”, there is a visible section for hero/background visuals that includes the hero background image upload control (using the existing `HomepageVisualsForm`).",
        "An admin can upload a hero background image from the “Home Page” tab and save successfully, and the uploaded image remains visible on refresh (based on settings data).",
        "An admin can remove the uploaded hero background image from the “Home Page” tab and save successfully, and the UI indicates the default background will be restored.",
        "No functionality is removed: existing homepage content editing (text) remains available in the “Home Page” tab, and the hero visuals controls (overlay color, overlay opacity, fallback gradient) remain usable.",
        "All user-facing helper text in the surfaced form remains in English and clearly explains: uploading replaces the default background; removing restores the default after saving."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request unless a blocking issue is discovered."
  ],
  "nonGoals": [
    "Redesigning the entire admin dashboard information architecture beyond making the homepage background upload easy to discover.",
    "Changing how hero images are stored or served (no blob/storage backend changes)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}